
## Plan Result (prod_dns)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.records[&#34;hass.heimelska.co.uk&#34;]
* Update
  * module.adguard_gamora.adguard_config.config
  * module.adguard_thanos.adguard_config.config


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.records["hass.heimelska.co.uk"] will be created
  + resource "cloudflare_dns_record" "records" {
      + content          = (sensitive value)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "hass.heimelska.co.uk"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = (sensitive value)
    }

  # module.adguard_gamora.adguard_config.config will be updated in-place
  ~ resource "adguard_config" "config" {
      ~ dns                             = {
          - allowed_clients            = [] -> null
          - disallowed_clients         = [] -> null
            # (26 unchanged attributes hidden)
        }
        id                              = "1"
      ~ last_updated                    = "Friday, 07-Nov-25 04:10:32 UTC" -> (known after apply)
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.adguard_thanos.adguard_config.config will be updated in-place
  ~ resource "adguard_config" "config" {
      ~ dns                             = {
          - allowed_clients            = [] -> null
          - disallowed_clients         = [] -> null
            # (26 unchanged attributes hidden)
        }
        id                              = "1"
      ~ last_updated                    = "Friday, 07-Nov-25 04:10:29 UTC" -> (known after apply)
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":861,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->